# Pandas

In [1]:
import numpy as np
import pandas as pd
#shift+tab=all parameters inside a function

## Pandas Series

In [2]:
labels=["a","b","c"]

In [3]:
data=[1,2,3]

In [4]:
a=np.array(data)
a

array([1, 2, 3])

In [5]:
d={"a":1,"b":2,"c":3}
d

{'a': 1, 'b': 2, 'c': 3}

In [6]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [7]:
#giving parameters data & index as labels & data respectively
#so we can change indexes as per our choice which will be different from default value
pd.Series(labels,data)

1    a
2    b
3    c
dtype: object

In [8]:
#printing dictionary as pandas series
pd.Series(d)

a    1
b    2
c    3
dtype: int64

In [9]:
series1=pd.Series(data=[1,2,3],index=["A","B","M"])
series1

A    1
B    2
M    3
dtype: int64

In [10]:
#accessing the values of series by indexing
series1["B"]

2

In [11]:
series2=pd.Series(data=[2,3,4,5],index=["B","M","X","Y"])
series2

B    2
M    3
X    4
Y    5
dtype: int64

In [12]:
#adding 2 series
#only the common index values get added and others show nan values
#adding integers in numpy/pandas gives a float result
series1+series2

A    NaN
B    4.0
M    6.0
X    NaN
Y    NaN
dtype: float64

## Pandas Data Frame

In [13]:
from numpy.random import randn

In [14]:
np.random.seed(10)

In [15]:
#randn=>print normal distribution numbers 3*3=9 times
#2nd parameter=>rows names, 3rd parameter=>columns names
df=pd.DataFrame(randn(3,3),["A","B","C"],["M","N","O"])
df

          M         N         O
A  1.331587  0.715279 -1.545400
B -0.008384  0.621336 -0.720086
C  0.265512  0.108549  0.004291

In [16]:
#extracting 1 single column from whole dataframe results in printing of a series
df["M"]

A    1.331587
B   -0.008384
C    0.265512
Name: M, dtype: float64

In [17]:
type(df["M"])

pandas.core.series.Series

In [18]:
#extracting more than 1 columns results in printing of a dataframe not a series 
df[["M","N"]]

          M         N
A  1.331587  0.715279
B -0.008384  0.621336
C  0.265512  0.108549

In [19]:
type(df[["M","N"]])

pandas.core.frame.DataFrame

In [20]:
#creation of new columns in dataframe
#new column is assigned values of sum of both columns
df["new"]=df["M"]+df["N"]
df["new"]

A    2.046865
B    0.612952
C    0.374060
Name: new, dtype: float64

In [21]:
df

          M         N         O       new
A  1.331587  0.715279 -1.545400  2.046865
B -0.008384  0.621336 -0.720086  0.612952
C  0.265512  0.108549  0.004291  0.374060

In [22]:
#deleting columns
#axis=0(default value)=>delete rows, axis=1(need to set)=>delete columns
#inplace=False(defualt value)=>doesn't reflect same change in actual df
#inplace=True(need to set)=>reflect the same change in actual df
df.drop("new",axis=1,inplace=True)

In [23]:
#the drop method change
df

          M         N         O
A  1.331587  0.715279 -1.545400
B -0.008384  0.621336 -0.720086
C  0.265512  0.108549  0.004291

In [24]:
#since here we are deleting the rows so we don't need to mention axis=0 separately
df.drop("A")

          M         N         O
B -0.008384  0.621336 -0.720086
C  0.265512  0.108549  0.004291

In [25]:
#since we didn't do inplace=True in last case so the change isn't reflected in actual dataframe 
#when not mentioned default value is inplace=True
df

          M         N         O
A  1.331587  0.715279 -1.545400
B -0.008384  0.621336 -0.720086
C  0.265512  0.108549  0.004291

In [26]:
#extracting 1 single row from whole dataframe results in printing of a series
#loc=>location, we have to mention name of row
df.loc["B"]

M   -0.008384
N    0.621336
O   -0.720086
Name: B, dtype: float64

In [27]:
#extracting 1 single row from whole dataframe results in printing of a series
#iloc=>index location, we have to mention index of row
df.iloc[1]

M   -0.008384
N    0.621336
O   -0.720086
Name: B, dtype: float64

In [28]:
#extracting 1 single element from dataframe
df.loc["B","N"]

0.6213359738904805

In [29]:
#extracting a submatrix
df.loc[["A","B"],["M","N"]]

          M         N
A  1.331587  0.715279
B -0.008384  0.621336

## Conditional Statements

In [30]:
#we get a dataframe with boolean values representing whether the value of cell is >0(True) or <0(False)
df>0

       M     N      O
A   True  True  False
B  False  True  False
C   True  True   True

In [31]:
#the new dataframe can be extracted according to the applied condition
#NaN=False, Numeric Values=True
df[df>0]

          M         N         O
A  1.331587  0.715279       NaN
B       NaN  0.621336       NaN
C  0.265512  0.108549  0.004291

In [32]:
#we get boolean series format
df["M"]>0

A     True
B    False
C     True
Name: M, dtype: bool

In [33]:
#if we use this inside a dataframe statement then we will only get the values which are true according to the condition
df[df["M"]>0]

          M         N         O
A  1.331587  0.715279 -1.545400
C  0.265512  0.108549  0.004291

In [34]:
#extracting only 1 column for which the condition is true
df[df["M"]>0]["O"]

A   -1.545400
C    0.004291
Name: O, dtype: float64

In [35]:
#using multiple conditions
#using conditional statements means we're comparing a series of boolean values
#and=>can compare only 2 boolean values, &=>can compare a series of boolean values
df[(df["M"]>0) & (df["N"]>0)]

          M         N         O
A  1.331587  0.715279 -1.545400
C  0.265512  0.108549  0.004291

In [36]:
#using conditional statements means we're comparing a series of boolean values
#or=>can compare only 2 boolean values, |=>can compare a series of boolean values
df[(df["M"]>0) | (df["N"]>0)]

          M         N         O
A  1.331587  0.715279 -1.545400
B -0.008384  0.621336 -0.720086
C  0.265512  0.108549  0.004291

## Reset Index

In [37]:
#gives the dataframe a default index by python and the changes are not reflected in actual dataframe
#to make changes in actual dataframe we have to use inplace=True
#stores the previous index in a new column called the "index"
df.reset_index()

  index         M         N         O
0     A  1.331587  0.715279 -1.545400
1     B -0.008384  0.621336 -0.720086
2     C  0.265512  0.108549  0.004291

## Set Index

In [38]:
newindex="CA NY OR".split()
newindex

['CA', 'NY', 'OR']

In [39]:
#adding a new column with the list values
#number of values in list should be equal to the number of rows
df["States"]=newindex
df

          M         N         O States
A  1.331587  0.715279 -1.545400     CA
B -0.008384  0.621336 -0.720086     NY
C  0.265512  0.108549  0.004291     OR

In [40]:
#setting the default index column as our preferred column
#deletes the previous index colunn completely
df.set_index("States")

               M         N         O
States
CA      1.331587  0.715279 -1.545400
NY     -0.008384  0.621336 -0.720086
OR      0.265512  0.108549  0.004291

## Dealing With Missing Values

In [41]:
#converting a dictionary to dataframe
a={"A":[1,2,np.nan],"B":[4,np.nan,np.nan],"C":[5,6,7]}
df=pd.DataFrame(a)
df

     A    B  C
0  1.0  4.0  5
1  2.0  NaN  6
2  NaN  NaN  7

In [42]:
#removing all rows that have null values
#doesn't affect the actual dataframe
df.dropna()

     A    B  C
0  1.0  4.0  5

In [43]:
#removing all columns that have null values
#default values are axis=0(rows) so we have to use axis=1(columns)
df.dropna(axis=1)

   C
0  5
1  6
2  7

In [44]:
#thresh=x gives rows/columns having atleast 2 non null values
df.dropna(thresh=2)

     A    B  C
0  1.0  4.0  5
1  2.0  NaN  6

In [45]:
#we can fill our desired values to the null values in dataframe
df.fillna(value=0,inplace=True)
df

     A    B  C
0  1.0  4.0  5
1  2.0  0.0  6
2  0.0  0.0  7

In [46]:
a={"A":[1,2,np.nan],"B":[4,np.nan,np.nan],"C":[5,6,7]}
df=pd.DataFrame(a)
df

     A    B  C
0  1.0  4.0  5
1  2.0  NaN  6
2  NaN  NaN  7

In [47]:
df["A"].fillna(value=df["A"].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

## Grouping Datas On Basis Of A Column

In [48]:
data={"Company":["Google","Google","Microsoft","Microsoft","Facebook","Facebook"],
      "Person":["Sam","Charlie","Amy","Vanessa","Carl","Sarah"],
      "Sales":[200,120,340,124,243,350]}
df=pd.DataFrame(data)
df

     Company   Person  Sales
0     Google      Sam    200
1     Google  Charlie    120
2  Microsoft      Amy    340
3  Microsoft  Vanessa    124
4   Facebook     Carl    243
5   Facebook    Sarah    350

In [49]:
#grouping data and storing that information inside a variable
group=df.groupby("Company")
group

In [50]:
#find mean of the possible column and grouping is done by "Company" column
group.mean()

           Sales
Company
Facebook   296.5
Google     160.0
Microsoft  232.0

In [51]:
#find sum of the possible column and grouping is done by "Company" column
group.sum()

           Sales
Company
Facebook     593
Google       320
Microsoft    464

In [52]:
#find count of the possible column and grouping is done by "Company" column
group.count()

           Person  Sales
Company
Facebook        2      2
Google          2      2
Microsoft       2      2

In [53]:
#finding maximum numerical value+highest alphabet names start with
group.max()

            Person  Sales
Company
Facebook     Sarah    350
Google         Sam    200
Microsoft  Vanessa    340

In [54]:
#finding minimum numerical value+highest alphabet names start with
group.min()

            Person  Sales
Company
Facebook      Carl    243
Google     Charlie    120
Microsoft      Amy    124

In [55]:
#getting all possible details 
group.describe()

          Sales
          count   mean         std    min     25%    50%     75%    max
Company
Facebook    2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
Google      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
Microsoft   2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [56]:
#getting transpose of a dataframe
group.describe().transpose()

Company        Facebook      Google   Microsoft
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [57]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']},
                    index=[0, 1, 2, 3])
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [58]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                    'B': ['B4', 'B5', 'B6', 'B7'],
                    'C': ['C4', 'C5', 'C6', 'C7'],
                    'D': ['D4', 'D5', 'D6', 'D7']},
                    index=[4, 5, 6, 7])
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

## Concatenation

In [59]:
#adding up the whole dataframe
#concatenating on basis of rows
pd.concat([df1,df2])

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [60]:
#adding up the whole dataframe
#concatenating on basis of columns
#we get null values because rows are different in both dataframes
pd.concat([df1,df2],axis=1)

     A    B    C    D    A    B    C    D
0   A0   B0   C0   D0  NaN  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN  NaN
2   A2   B2   C2   D2  NaN  NaN  NaN  NaN
3   A3   B3   C3   D3  NaN  NaN  NaN  NaN
4  NaN  NaN  NaN  NaN   A4   B4   C4   D4
5  NaN  NaN  NaN  NaN   A5   B5   C5   D5
6  NaN  NaN  NaN  NaN   A6   B6   C6   D6
7  NaN  NaN  NaN  NaN   A7   B7   C7   D7

## Merging

In [61]:
left=pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                      'A': ['A0', 'A1', 'A2', 'A3'],
                      'B': ['B0', 'B1', 'B2', 'B3']})
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [62]:
right=pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                      'C': ['C0', 'C1', 'C2', 'C3'],
                      'D': ['D0', 'D1', 'D2', 'D3']})
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [63]:
#one of the most famous ways to merge is inner merging
#merging is done on basis of a common column which is value of "on" parameter
#there can be multiple key values in that case we'll do on=["key1","key2"]
pd.merge(left,right,how="inner",on="key")

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

## Joining

In [64]:
left=pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                   'B': ['B0', 'B1', 'B2']},
                    index=['K0', 'K1', 'K2'])
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [65]:
right=pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                      'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [66]:
#joining dataframes is done on basis of common index
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [67]:
#inner(output has no missing values)=default,outer(output has missing values)=need to set
left.join(right,how="outer")

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

## Special Pandas Operation

In [68]:
df=pd.DataFrame({"col1":[1,2,3,4,5,6],
                "col2":[444,555,666,444,777,666],
                "col3":["abc","def","ghi","jkl","mno","xyz"]})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  jkl
4     5   777  mno
5     6   666  xyz

In [69]:
#display top 5 rows
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  jkl
4     5   777  mno

In [70]:
#get all the unique values stored in a particular column of the dataframe
df["col2"].unique()

array([444, 555, 666, 777], dtype=int64)

In [71]:
#get the number of unique values stored in a particular column of the dataframe
df["col2"].nunique()

4

In [72]:
#finding how many times each unique value occured in a column
df["col2"].value_counts()

444    2
666    2
555    1
777    1
Name: col2, dtype: int64

In [73]:
#declaration of functions
def times2(x):
    return x*2

In [74]:
#calling the function for using
df["col1"].apply(times2)

0     2
1     4
2     6
3     8
4    10
5    12
Name: col1, dtype: int64

In [75]:
#when we need to use function once we can use lambda function instead of declaring function separately
df["col1"].apply(lambda x: x*2)

0     2
1     4
2     6
3     8
4    10
5    12
Name: col1, dtype: int64

In [77]:
#deleting a column from the dataframe
#changes are not reflected in actual dataframe
df.drop("col1",axis=1)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  jkl
4   777  mno
5   666  xyz

In [78]:
#get names of all columns
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [79]:
#get the starting and ending index 
df.index

RangeIndex(start=0, stop=6, step=1)

In [81]:
df.sort_values("col2")

   col1  col2 col3
0     1   444  abc
3     4   444  jkl
1     2   555  def
2     3   666  ghi
5     6   666  xyz
4     5   777  mno

In [82]:
#chcking if null values are present or not and output is boolean form
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False  False

In [83]:
#pd.read_csv("file.csv")=>reading csv file
#pd.read_excel("file.xlsx",sheet_name="Sheet1")=>reading excel file sheet wise
#pd.read_html("https//www.files.com")